_posts/technology/2023-03-13-cppcoreguidelines-es6.html
---
layout: post
title: CppCoreGuidelines ES.6 在 for 的初始化和条件判断处声明变量，限制变量范围
categories: [technology]
tags: [CppCoreGuidelines]
---
<p>
<a href="http://kimi.im/tags.html#CppCoreGuidelines-ref">C++ 核心指南目录</a>
</p>

<p>
&ldquo;Declare names in for-statement initializers and conditions to limit
scope&rdquo;
</p>


<p>
理由
</p>


<p>
高可读性。在循环或条件判断的范围内限制变量的作用域。避免在循环或条件判断外使用循环变量。缩小资源驻留期。
</p>


<p>
例子
</p>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #000000; font-style: italic; text-decoration: underline;">void</span> <span style="color: #0000ff; font-weight: bold;">use</span><span style="color: #707183;">()</span>
<span style="color: #707183;">{</span>
    <span style="color: #7F0055; font-weight: bold;">for</span> <span style="color: #7388d6;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">string</span> <span style="color: #000000;">s</span>; cin &gt;&gt; s;<span style="color: #7388d6;">)</span>
        v.push_back<span style="color: #7388d6;">(</span>s<span style="color: #7388d6;">)</span>;

    <span style="color: #7F0055; font-weight: bold;">for</span> <span style="color: #7388d6;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">int</span> <span style="color: #000000;">i</span> = 0; i &lt; 20; ++i<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">{</span>
    <span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">good: i is local to for-loop</span>
        <span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">...</span>
    <span style="color: #7388d6;">}</span>

    <span style="color: #7F0055; font-weight: bold;">if</span> <span style="color: #7388d6;">(</span><span style="color: #7F0055; font-weight: bold;">auto</span> <span style="color: #000000;">pc</span> = <span style="color: #7F0055; font-weight: bold;">dynamic_cast</span><span style="color: #909183;">&lt;</span><span style="color: #000000; font-style: italic; text-decoration: underline;">Circle</span>*<span style="color: #909183;">&gt;(</span>ps<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span> <span style="color: #7388d6;">{</span>
    <span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">good: pc is local to if-statement</span>
        <span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">... deal with Circle ...</span>
    <span style="color: #7388d6;">}</span>
    <span style="color: #7F0055; font-weight: bold;">else</span> <span style="color: #7388d6;">{</span>
        <span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">... handle error ...</span>
    <span style="color: #7388d6;">}</span>
<span style="color: #707183;">}</span>
</pre>
</div>

<p>
坏例子
</p>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #000000; font-style: italic; text-decoration: underline;">int</span> <span style="color: #000000;">j</span>;                            <span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">BAD: j is visible outside the loop</span>
<span style="color: #7F0055; font-weight: bold;">for</span> <span style="color: #707183;">(</span>j = 0; j &lt; 100; ++j<span style="color: #707183;">)</span> <span style="color: #707183;">{</span>
    <span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">...</span>
<span style="color: #707183;">}</span>
<span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">j is still visible here and isn't needed</span>
</pre>
</div>


<p>
强化
</p>

<p>
标注警告：如果一个变量在 for 循环外部声明，在循环内中修改了，之后没有被使用。
</p>

<p>
标注警告：如果一个变量在循环前声明，在循环后又做其他用途。
</p>


<p>
讨论
</p>

<p>
限定循环变量的使用范围可以帮助优化代码。如果能识别出变量只在循环中使用，可以发掘潜在的优化可能：比如通过代码提升（把内部循环提升到外部执行）、强度减弱（用消耗小的等价代码替代耗费资源的的代码），循环不变代码移动（Loop-Invarian Code Motion (LICM)，通过发现每次循环执行的结果不变，直接用替代结果）。
</p>


<p>
C++17 和 C++20 的例子
</p>

<p>
注意， C++17 和 C++20 还引入了 if, switch, 范围 for 的初始化语句。
</p>

<p>
比如
</p>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #000000; font-style: italic; text-decoration: underline;">map</span><span style="color: #707183;">&lt;</span><span style="color: #000000; font-style: italic; text-decoration: underline;">int</span>, <span style="color: #000000; font-style: italic; text-decoration: underline;">string</span><span style="color: #707183;">&gt;</span> <span style="color: #000000;">mymap</span><span style="color: #707183;">{</span><span style="color: #7388d6;">{</span>1, <span style="color: #2A00FF;">"one"</span><span style="color: #7388d6;">}</span>, <span style="color: #7388d6;">{</span>2, <span style="color: #2A00FF;">"two"</span><span style="color: #7388d6;">}</span><span style="color: #707183;">}</span>;
 
<span style="color: #7F0055; font-weight: bold;">if</span> <span style="color: #707183;">(</span><span style="color: #7F0055; font-weight: bold;">auto</span> <span style="color: #000000;">result</span> = mymap.insert<span style="color: #7388d6;">(</span><span style="color: #909183;">{</span>4, <span style="color: #2A00FF;">"three"</span><span style="color: #909183;">}</span><span style="color: #7388d6;">)</span>; result.second<span style="color: #707183;">)</span> <span style="color: #707183;">{</span>
    <span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">insert succeeded, and result is valid for this block</span>
    cout &lt;&lt; result.first-&gt;second;  <span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">ok</span>
    <span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">...</span>
<span style="color: #707183;">}</span> <span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">result is destroyed here</span>
</pre>
</div>

<pre class="example">
three
</pre>



<p>
针对 C++17 和 C++20 的强化
</p>

<p>
标注选择/循环变量在语句前声明的情况
</p>

<p>
标注在选择/循环语句前声明，却在语句后用作它途的情况
</p>
